
# **Контрольная работа №1**

**Данная контрольная работа проводится для провепки знаний, полученных по итогу прохождения первого блока обучения на программе разработчик.*
## Содержание контрольной работы: ##

1. Создать репозиторий на GitHub
2. Нарисовать блок-схему алгоритма
3. Снабдить репозиторий оформленным текстовым описанием решения (файл README.md)
4. Написать программу, решающую поставленную задачу
5. Использовать контроль версий в работе над проектом (не должно быть так, что всё залито одним коммитом, как минимум этапы 2, 3 и 4 должны быть расположены в разных коммитах)
### **Задача:** 
#### Написать программу , которая из имеющегося массива строк формирует массив из строк, длинна которых меньше либо равна 3 символа. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

## Описание выполнения задания:
### **1. Создание удалённого репозитория**
На сервисе GitHub создан удаленный репозиторий на котором будут сохранены все материалы, связанные с решением контрольной работы, а именно:
1. Блок-схема алгоритма в файле  Task_FlowCharts.drawio
2. Папка с кодом на языке C# Task_Code
3. Файл с описанием решения README.md 

Наименование удаленного репозитория  ControlWork_1_02/10/2022, ссылка https://github.com/vvr1960/ControlWork_1_02.10.2022.

### **2. Ход решения задачи**
При решении задачи формируется три блока:
1. Блок объявления переменных, которые будут участвовать в дальнейшей обработке данных
2. Блок ввода данных с клавиатуры
3. Блок обработки и сортировки данных, с целью формирования массива, удовлетворяющего условиям задачи
4. Вывод вновь сформированого массива 
#### **Объявление переменных**
Для использования в решении задачи требуется объявить следующие переменные:
1. *Arr* - массив строк, которые пользователь введёт с клавиатуры
2. *count* - текущее количество строк в массиве
3. *stroka* - строки, которые вводит пользователь с клавиатуры и которые формируют исходный массив
4. *Arr2* - дополнительный (промежуточный) массив
#### **Ввод данных**
Для ввода данных с клавиатуры используем метод Console.WriteLine(). Данные представляют из себя набор символов любой длинны (введение пустой строки исключается), которые разделяются нажатием клавиши "Enter". Количество вводимых строк определяет пользователь и здравый смысл.
#### **Обработка и сортировка данных**
Для решения основной, логической части задачи, используется цикл **do-while**. Условием выхода из цикла является наличие пустой строки. С помощью метода Console.ReadLine() считываются значения, введённые с клавиатуры и присваиваются переменной *stroka*. С помощью оператора **if** происходит сортировка значений для определения тех, которые соответствуют условию задачи (меньше или равно 3 символам). Удовлетворяющие условию задачи данные формируют промежуточный массив Arr2[]. Впоследствии отсортированные данные перегружаются в исходный массив Arr[]. 
#### **Вывод нового массива**
Для вывода массива Arr[] со строками, удовлетворяющими условию задачи используем цикл **for** и метод Console.WriteLine(). 

